# WorksetConfiguration Constructor (WorksetConfigurationOption)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetConfiguration Constructor (WorksetConfigurationOption)
WorksetConfiguration Class See Also
---
Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public WorksetConfiguration(
	WorksetConfigurationOption option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As WorksetConfigurationOption _
)
```

Visual C++
---
```text
public:
WorksetConfiguration(
	WorksetConfigurationOption option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..WorksetConfigurationOption The option to open or close all user created worksets by default.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WorksetConfiguration Class
WorksetConfiguration Overload
Autodesk.Revit.DB Namespace